---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainerIterator.CurrentObject
source: html/97b62f7d-49d3-7f05-bdc8-980b9c791379.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```